# Current Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSizeIterator..::..Current Property
DuctSizeIterator Class See Also
---
Gets the item at the current position of the iterator.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual MEPSize Current { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Current As MEPSize
	Get
```

Visual C++
---
```text
public:
virtual property MEPSize^ Current {
	MEPSize^ get ();
}
```

# ### Implements
IEnumerator<(Of <(<'T>)>)>..::..Current
# Remarks
There is no current item if the iterator has not started yet or has been done.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
DuctSizeIterator Class
Autodesk.Revit.DB.Mechanical Namespace